cases/openfoam-4.x/CounterFlow/Coarse/laminarBuoyantPimpleSMOKE-flamelet/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   	uniform 101325.;

boundaryField
{
    fuelinlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    oxidizerinlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    outlet
    {
        type            totalPressure;
        p0              $internalField;
        U               U;
        phi             phi;
        rho             rho;
        psi             psi;
        gamma           1;
        value           $internalField;
    }
    bottom
    {
        type            wedge;
    }
    top
    {
        type            wedge;
    }
    walls
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
